Tekla Open API Reference for Tekla Structures 2025
PointCloud.Attach Method
 Attach this point cloud to model. Can select only Potree type point clouds immediately after attach. Others need to be selected manually after attach has been completed. Use AttachComplete() to find out, if attach process has completed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Attach()
Public Function Attach As Boolean
Return Value
Type: Boolean
True if successful, otherwise false.
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace